tutorials/battery_samples/jdp-multiRegionTutorial/0/region1/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 300;
    }
    maxX
    {
        type            calculated;
        value           uniform 300;
    }
    minY
    {
        type            calculated;
        value           uniform 300;
    }
    minZ
    {
        type            calculated;
        value           uniform 300;
    }
    maxZ
    {
        type            calculated;
        value           uniform 300;
    }
    region1_to_water
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
