tutorials/battery_samples/jdp-multiRegionTutorial/0/region1/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minY
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            calculated;
        value           uniform 100000;
    }
    maxZ
    {
        type            calculated;
        value           uniform 100000;
    }
    region1_to_water
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
