tutorials/battery_samples/jdp-multiRegionTutorial/0/water/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/water";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            zeroGradient;
        value           uniform 0;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minZ
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    maxZ
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    water_to_region1
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    water_to_heater
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}


// ************************************************************************* //
