tutorials/battery_samples/jdp-multiRegionTutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       8300;
    }
    minX
    {
        type            patch;
        nFaces          100;
        startFace       8600;
    }
    maxX
    {
        type            patch;
        nFaces          100;
        startFace       8700;
    }
    minY
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       8800;
    }
    minZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       9100;
    }
    maxZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       9400;
    }
)

// ************************************************************************* //
